In [3]:
import pandas as pd
import numpy as np

In [51]:
df = pd.DataFrame(np.arange(12).reshape(4,3), columns=list('ABC'))
df

   A   B   C
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [52]:
al = df.loc[:, 'A']
bl = df.loc[:, 'B']

In [53]:
a=df['A']
b=df['B']

In [63]:
#df['A']= df.loc[:, 'B']
sl=df.loc[2:3,'A']

In [71]:
df[df==5]['A']*=2

In [72]:
df

    A   B   C
0   2   1   2
1   5   4   5
2  16   7   8
3  22  10  11

In [77]:
df[df==5]['A']=100

In [78]:
df

    A   B   C
0   2   1   2
1   5   4   5
2  16   7   8
3  22  10  11

In [107]:
tmp=df[df['A']==2]

In [108]:
tmp

   A  B  C
0  2  1  2

In [109]:
df[df['A']==2]=80

tmp

In [110]:
tmp

   A  B  C
0  2  1  2

In [111]:
df

    A   B   C
0  80  80  80
1  10   4   5
2  16   7   8
3  22  10  11

In [100]:
foo = pd.DataFrame(np.random.random((10,5)), columns=list('ABCDE'))

In [101]:
foo

          A         B         C         D         E
0  0.237821  0.573401  0.280229  0.937444  0.254111
1  0.580964  0.438795  0.586557  0.677496  0.720507
2  0.436605  0.408949  0.332955  0.205232  0.308251
3  0.119740  0.171346  0.919099  0.917290  0.971806
4  0.091811  0.762245  0.456278  0.672461  0.652368
5  0.421891  0.810629  0.725616  0.984641  0.223032
6  0.203081  0.846647  0.074502  0.314670  0.007667
7  0.672150  0.213795  0.148474  0.043307  0.926084
8  0.669914  0.093713  0.226740  0.822728  0.290309
9  0.913672  0.688351  0.773779  0.011927  0.887392

In [102]:
bar = foo.iloc[3:5,1:4]

In [103]:
bar

          B         C         D
3  0.171346  0.919099  0.917290
4  0.762245  0.456278  0.672461

In [104]:
bar['B']=bar['C']

In [105]:
bar

          B         C         D
3  0.919099  0.919099  0.917290
4  0.456278  0.456278  0.672461

In [106]:
foo

          A         B         C         D         E
0  0.237821  0.573401  0.280229  0.937444  0.254111
1  0.580964  0.438795  0.586557  0.677496  0.720507
2  0.436605  0.408949  0.332955  0.205232  0.308251
3  0.119740  0.919099  0.919099  0.917290  0.971806
4  0.091811  0.456278  0.456278  0.672461  0.652368
5  0.421891  0.810629  0.725616  0.984641  0.223032
6  0.203081  0.846647  0.074502  0.314670  0.007667
7  0.672150  0.213795  0.148474  0.043307  0.926084
8  0.669914  0.093713  0.226740  0.822728  0.290309
9  0.913672  0.688351  0.773779  0.011927  0.887392